Tekla Open API Reference for Tekla Structures 2025
ClipPlaneCollection Class
 The ClipPlaneCollection class handles the collection of the clip planes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.ClipPlaneCollection
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ClipPlaneCollection : ICollection,
	IEnumerable
<SerializableAttribute>
Public NotInheritable Class ClipPlaneCollection
	Implements ICollection, IEnumerable
The ClipPlaneCollection type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
Methods
Name | Description
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
Top
See Also
Reference
Tekla.Structures.Model.UI Namespace